testdata/IN_2023_02/Roundtrip/produkt/kapital/fwvl/20121129_gewinnsicherung_ja_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getQuote xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vbl="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
          
      <tarif:Request>
                
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
                
        <tarif:Tarifierung>
                      
          <tarif:Partner xsi:type="partner:CT_Person">
                            
            <partner:PartnerID>1</partner:PartnerID>
                            
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
                            
            <partner:Geschlecht>1</partner:Geschlecht>
                        
          </tarif:Partner>
                      
          <tarif:Verkaufsprodukt>
                            
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                                  
              <basis:Erweiterung xsi:type="vbl:CT_ProduktErweiterung">
                                        
                <vbl:Tarifgruppe>Normal</vbl:Tarifgruppe>
                                    
              </basis:Erweiterung>
                                  
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
                                  
              <pm:Beitrag>
                                        
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                                        
                <pm:Betrag>
                                            
                  <allg:Betrag>40</allg:Betrag>
                                            
                  <allg:Waehrung>EUR</allg:Waehrung>
                                          
                </pm:Betrag>
                                        
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                                    
              </pm:Beitrag>
                                  
              <pm:Versicherungsdauer>
                                      
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                 
                    
              </pm:Versicherungsdauer>
                                  
              <pm:Kennung>FWVL</pm:Kennung>
                                  
              <pm:Elementarprodukt xsi:type="pm-leben:CT_Rente">
                                        
                <basis:Erweiterung xsi:type="vbl:CT_RenteErweiterung">
                                              
                  <vbl:Gewinnsicherung>true</vbl:Gewinnsicherung>
                                          
                </basis:Erweiterung>
                                        
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                                        
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="dt:STE_UeberschussverwendungBasis">12</pm-leben:UeberschussverwendungVorLeistung>
                                        
                <pm-leben:VersichertePerson>
                                              
                  <partner:PartnerID>1</partner:PartnerID>
                                          
                </pm-leben:VersichertePerson>
                                    
              </pm:Elementarprodukt>
                                  
              <pm-leben:VorgabeBerechnung>
                                        
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Bruttobeitrag</pm-leben:ArtID>
                                        
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">Produkt</pm-leben:Kontext>
                                    
              </pm-leben:VorgabeBerechnung>
                              
            </pm:Produkt>
                        
          </tarif:Verkaufsprodukt>
                  
        </tarif:Tarifierung>
            
      </tarif:Request>
      
    </tarif:getQuote>
  </soapenv:Body>
</soapenv:Envelope>
